tinko26/ao/src/ao_sys_xc32_pic32/ao_can_1.h
#define AO_CAN_FILTER_FIFO_1_0          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_0

#define AO_CAN_FILTER_IDE_1_0           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_0

#define AO_CAN_FILTER_MASK_1_0          (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_0

#define AO_CAN_FILTER_SID_1_0           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_1

#define AO_CAN_FILTER_EID_1_1           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_1

#define AO_CAN_FILTER_ENABLE_1_1        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_1

#define AO_CAN_FILTER_FIFO_1_1          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_1

#define AO_CAN_FILTER_IDE_1_1           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_1

#define AO_CAN_FILTER_MASK_1_1          (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_1

#define AO_CAN_FILTER_SID_1_1           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_2

#define AO_CAN_FILTER_EID_1_2           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_2

#define AO_CAN_FILTER_ENABLE_1_2        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_2

#define AO_CAN_FILTER_FIFO_1_2          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_2

#define AO_CAN_FILTER_IDE_1_2           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_2

#define AO_CAN_FILTER_MASK_1_2          (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_2

#define AO_CAN_FILTER_SID_1_2           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_3

#define AO_CAN_FILTER_EID_1_3           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_3

#define AO_CAN_FILTER_ENABLE_1_3        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_3

#define AO_CAN_FILTER_FIFO_1_3          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_3

#define AO_CAN_FILTER_IDE_1_3           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_3

#define AO_CAN_FILTER_MASK_1_3          (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_3

#define AO_CAN_FILTER_SID_1_3           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_4

#define AO_CAN_FILTER_EID_1_4           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_4

#define AO_CAN_FILTER_ENABLE_1_4        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_4

#define AO_CAN_FILTER_FIFO_1_4          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_4

#define AO_CAN_FILTER_IDE_1_4           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_4

#define AO_CAN_FILTER_MASK_1_4          (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_4

#define AO_CAN_FILTER_SID_1_4           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_5

#define AO_CAN_FILTER_EID_1_5           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_5

#define AO_CAN_FILTER_ENABLE_1_5        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_5

#define AO_CAN_FILTER_FIFO_1_5          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_5

#define AO_CAN_FILTER_IDE_1_5           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_5

#define AO_CAN_FILTER_MASK_1_5          (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_5

#define AO_CAN_FILTER_SID_1_5           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_6

#define AO_CAN_FILTER_EID_1_6           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_6

#define AO_CAN_FILTER_ENABLE_1_6        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_6

#define AO_CAN_FILTER_FIFO_1_6          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_6

#define AO_CAN_FILTER_IDE_1_6           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_6

#define AO_CAN_FILTER_MASK_1_6          (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_6

#define AO_CAN_FILTER_SID_1_6           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_7

#define AO_CAN_FILTER_EID_1_7           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_7

#define AO_CAN_FILTER_ENABLE_1_7        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_7

#define AO_CAN_FILTER_FIFO_1_7          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_7

#define AO_CAN_FILTER_IDE_1_7           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_7

#define AO_CAN_FILTER_MASK_1_7          (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_7

#define AO_CAN_FILTER_SID_1_7           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_8

#define AO_CAN_FILTER_EID_1_8           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_8

#define AO_CAN_FILTER_ENABLE_1_8        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_8

#define AO_CAN_FILTER_FIFO_1_8          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_8

#define AO_CAN_FILTER_IDE_1_8           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_8

#define AO_CAN_FILTER_MASK_1_8          (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_8

#define AO_CAN_FILTER_SID_1_8           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_9

#define AO_CAN_FILTER_EID_1_9           (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_9

#define AO_CAN_FILTER_ENABLE_1_9        (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_9

#define AO_CAN_FILTER_FIFO_1_9          (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_9

#define AO_CAN_FILTER_IDE_1_9           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_9

#define AO_CAN_FILTER_MASK_1_9          (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_9

#define AO_CAN_FILTER_SID_1_9           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_10

#define AO_CAN_FILTER_EID_1_10          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_10

#define AO_CAN_FILTER_ENABLE_1_10       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_10

#define AO_CAN_FILTER_FIFO_1_10         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_10

