tinko26/ao/src/ao_sys_xc32_pic32/ao_can_1.h
#define AO_CAN_FILTER_EID_1_22          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_22

#define AO_CAN_FILTER_ENABLE_1_22       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_22

#define AO_CAN_FILTER_FIFO_1_22         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_22

#define AO_CAN_FILTER_IDE_1_22          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_22

#define AO_CAN_FILTER_MASK_1_22         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_22

#define AO_CAN_FILTER_SID_1_22          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_23

#define AO_CAN_FILTER_EID_1_23          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_23

#define AO_CAN_FILTER_ENABLE_1_23       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_23

#define AO_CAN_FILTER_FIFO_1_23         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_23

#define AO_CAN_FILTER_IDE_1_23          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_23

#define AO_CAN_FILTER_MASK_1_23         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_23

#define AO_CAN_FILTER_SID_1_23          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_24

#define AO_CAN_FILTER_EID_1_24          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_24

#define AO_CAN_FILTER_ENABLE_1_24       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_24

#define AO_CAN_FILTER_FIFO_1_24         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_24

#define AO_CAN_FILTER_IDE_1_24          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_24

#define AO_CAN_FILTER_MASK_1_24         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_24

#define AO_CAN_FILTER_SID_1_24          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_25

#define AO_CAN_FILTER_EID_1_25          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_25

#define AO_CAN_FILTER_ENABLE_1_25       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_25

#define AO_CAN_FILTER_FIFO_1_25         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_25

#define AO_CAN_FILTER_IDE_1_25          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_25

#define AO_CAN_FILTER_MASK_1_25         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_25

#define AO_CAN_FILTER_SID_1_25          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_26

#define AO_CAN_FILTER_EID_1_26          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_26

#define AO_CAN_FILTER_ENABLE_1_26       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_26

#define AO_CAN_FILTER_FIFO_1_26         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_26

#define AO_CAN_FILTER_IDE_1_26          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_26

#define AO_CAN_FILTER_MASK_1_26         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_26

#define AO_CAN_FILTER_SID_1_26          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_27

#define AO_CAN_FILTER_EID_1_27          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_27

#define AO_CAN_FILTER_ENABLE_1_27       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_27

#define AO_CAN_FILTER_FIFO_1_27         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_27

#define AO_CAN_FILTER_IDE_1_27          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_27

#define AO_CAN_FILTER_MASK_1_27         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_27

#define AO_CAN_FILTER_SID_1_27          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_28

#define AO_CAN_FILTER_EID_1_28          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_28

#define AO_CAN_FILTER_ENABLE_1_28       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_28

#define AO_CAN_FILTER_FIFO_1_28         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_28

#define AO_CAN_FILTER_IDE_1_28          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_28

#define AO_CAN_FILTER_MASK_1_28         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_28

#define AO_CAN_FILTER_SID_1_28          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_29

#define AO_CAN_FILTER_EID_1_29          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_29

#define AO_CAN_FILTER_ENABLE_1_29       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_29

#define AO_CAN_FILTER_FIFO_1_29         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_29

#define AO_CAN_FILTER_IDE_1_29          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_29

#define AO_CAN_FILTER_MASK_1_29         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_29

#define AO_CAN_FILTER_SID_1_29          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_30

#define AO_CAN_FILTER_EID_1_30          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_30

#define AO_CAN_FILTER_ENABLE_1_30       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_30

#define AO_CAN_FILTER_FIFO_1_30         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_30

#define AO_CAN_FILTER_IDE_1_30          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_30

#define AO_CAN_FILTER_MASK_1_30         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_30

#define AO_CAN_FILTER_SID_1_30          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_31

#define AO_CAN_FILTER_EID_1_31          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_31

#define AO_CAN_FILTER_ENABLE_1_31       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_31

#define AO_CAN_FILTER_FIFO_1_31         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_31

#define AO_CAN_FILTER_IDE_1_31          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_31

#define AO_CAN_FILTER_MASK_1_31         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_31

#define AO_CAN_FILTER_SID_1_31          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_1_0

#define AO_CAN_FILTER_MASK_EID_1_0      (0)

#endif

