tinko26/ao/src/ao_sys_xc32_pic32/ao_can_1.h
#ifndef AO_CAN_FILTER_MASK_IDE_1_0

#define AO_CAN_FILTER_MASK_IDE_1_0      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_1_0

#define AO_CAN_FILTER_MASK_SID_1_0      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_1_1

#define AO_CAN_FILTER_MASK_EID_1_1      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_1_1

#define AO_CAN_FILTER_MASK_IDE_1_1      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_1_1

#define AO_CAN_FILTER_MASK_SID_1_1      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_1_2

#define AO_CAN_FILTER_MASK_EID_1_2      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_1_2

#define AO_CAN_FILTER_MASK_IDE_1_2      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_1_2

#define AO_CAN_FILTER_MASK_SID_1_2      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_1_3

#define AO_CAN_FILTER_MASK_EID_1_3      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_1_3

#define AO_CAN_FILTER_MASK_IDE_1_3      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_1_3

#define AO_CAN_FILTER_MASK_SID_1_3      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_INVALID_1

#define AO_CAN_INVALID_1                (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_MODE_1

#define AO_CAN_MODE_1                   (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_OVERFLOW_1

#define AO_CAN_OVERFLOW_1               (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_SENT_1

#define AO_CAN_SENT_1                   (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_SYSTEM_1

#define AO_CAN_SYSTEM_1                 (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_TIMER_1

#define AO_CAN_TIMER_1                  (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_UNDERFLOW_1

#define AO_CAN_UNDERFLOW_1              (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_WAKE_UP_1

#define AO_CAN_WAKE_UP_1                (false)

#endif

// ----------------------------------------------------------------------------

// Constants.

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BAUD_MAX_1

#define AO_CAN_BAUD_MAX_1               AO_CAN_BAUD_MAX(AO_SYS_CLOCK_CAN1)

#endif

#ifndef AO_CAN_BAUD_MIN_1

#define AO_CAN_BAUD_MIN_1               AO_CAN_BAUD_MIN(AO_SYS_CLOCK_CAN1)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BUFFERS_1

#define AO_CAN_BUFFERS_1                                                    \
(                                                                           \
        (AO_CAN_BUFFERS_1_0)  +                                             \
        (AO_CAN_BUFFERS_1_1)  +                                             \
        (AO_CAN_BUFFERS_1_2)  +                                             \
        (AO_CAN_BUFFERS_1_3)  +                                             \
        (AO_CAN_BUFFERS_1_4)  +                                             \
        (AO_CAN_BUFFERS_1_5)  +                                             \
        (AO_CAN_BUFFERS_1_6)  +                                             \
        (AO_CAN_BUFFERS_1_7)  +                                             \
        (AO_CAN_BUFFERS_1_8)  +                                             \
        (AO_CAN_BUFFERS_1_9)  +                                             \
        (AO_CAN_BUFFERS_1_10) +                                             \
        (AO_CAN_BUFFERS_1_11) +                                             \
        (AO_CAN_BUFFERS_1_12) +                                             \
        (AO_CAN_BUFFERS_1_13) +                                             \
        (AO_CAN_BUFFERS_1_14) +                                             \
        (AO_CAN_BUFFERS_1_15) +                                             \
        (AO_CAN_BUFFERS_1_16) +                                             \
        (AO_CAN_BUFFERS_1_17) +                                             \
        (AO_CAN_BUFFERS_1_18) +                                             \
        (AO_CAN_BUFFERS_1_19) +                                             \
        (AO_CAN_BUFFERS_1_20) +                                             \
        (AO_CAN_BUFFERS_1_21) +                                             \
        (AO_CAN_BUFFERS_1_22) +                                             \
        (AO_CAN_BUFFERS_1_23) +                                             \
        (AO_CAN_BUFFERS_1_24) +                                             \
        (AO_CAN_BUFFERS_1_25) +                                             \
        (AO_CAN_BUFFERS_1_26) +                                             \
        (AO_CAN_BUFFERS_1_27) +                                             \
        (AO_CAN_BUFFERS_1_28) +                                             \
        (AO_CAN_BUFFERS_1_29) +                                             \
        (AO_CAN_BUFFERS_1_30) +                                             \
        (AO_CAN_BUFFERS_1_31)                                               \
)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FIFOS_1

#define AO_CAN_FIFOS_1                                                      \
(                                                                           \
        (AO_CAN_FIFOS_RX_1) +                                               \
        (AO_CAN_FIFOS_TX_1)                                                 \
)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_RX_1

#define AO_CAN_RX_1                                                         \
(                                                                           \
        (AO_CAN_FIFOS_RX_1) > 0                                             \
        ? true                                                              \
        : false                                                             \
)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_TX_1

