tinko26/ao/src/ao_sys_xc32_pic32/ao_can_1.h
#define AO_CAN_TX_1                                                         \
(                                                                           \
        (AO_CAN_FIFOS_TX_1) > 0                                             \
        ? true                                                              \
        : false                                                             \
)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_can_reg_1

#define ao_can_reg_1()                                                      \
(                                                                           \
        (ao_can_reg_t *)                                                    \
        (                                                                   \
            _CAN1_BASE_ADDRESS                                              \
        )                                                                   \
)

#endif

// ----------------------------------------------------------------------------

void    ao_can_listen_all_1();

void    ao_can_listen_only_1();

void    ao_can_loopback_1();

void    ao_can_normal_1();

// ----------------------------------------------------------------------------

void    ao_can_start_1();

void    ao_can_stop_1();

// ----------------------------------------------------------------------------

void    ao_can_bus_1(                   ao_can_bus_t const * x);

void    ao_can_invalid_1();

void    ao_can_mode_1();

void    ao_can_overflow_1(              uint32_t fifos);

void    ao_can_sent_1(                  uint32_t fifos);

void    ao_can_system_1(                ao_can_system_t x);

void    ao_can_timer_1();

void    ao_can_underflow_1(             uint32_t fifos);

void    ao_can_wake_up_1();

// ----------------------------------------------------------------------------

extern  ao_send_obj_t                   ao_can_in_1     [AO_CAN_FIFOS_RX_1];

extern  ao_recv_obj_t                   ao_can_out_1    [AO_CAN_FIFOS_TX_1];

// ----------------------------------------------------------------------------

extern  ao_task_t                       ao_can_task_1;

// ----------------------------------------------------------------------------
